using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Ekpaideutiko_L
{
    public partial class Form11 : Form
    {
        public Form11()
        {
            InitializeComponent();
        }

        private void label2_Click(object sender, EventArgs e)
        {
            this.Close();
        }

        private void Form11_Load(object sender, EventArgs e)
        {
            if (Form2.f2)
            {
                Form2.f2 = false;
                listBox1.Items.Clear();
                listBox1.Items.Add("Ξεκίνα απο το πρώτο επίπεδο, μαθε καλά την θεωρία ,πέρασε τα τεστ");
                listBox1.Items.Add("ετσι ωστε να ξεκλιδωσεις και τα άλλα επίπεδα καταλήγωντας στο ");
                listBox1.Items.Add("τελικό ερωτηματολόγιο όπου θα σου προτεινει επαγγελματικο προσανατολισμό ");
                listBox1.Items.Add("αλλα και μεταπτυχιακα ανάλογα με τις προτιμησεις σου ");
                listBox1.Items.Add("Το τελικο ερωτηματολογιο θα εμφανιστει στο προφιλ σου μετα την ολοκληρωση  ");
                listBox1.Items.Add("και των 4 επιπέδων αλλα και του επαναληπτικου τεστ!!!!  ");
                listBox1.Items.Add("Πηγαινοντας τον κερσορα πανω απο το κουμπι της καθε ενοτητας θα σου εμφανιζονται δεξια το περιεχομενο αυτης ");
            }
            else if (Form3.f3) 
            {
                Form3.f3 = false;
                listBox1.Items.Clear();
                listBox1.Items.Add("Για να ολοκληρώσεις την εγγραφη θα πρέπει να επιλεξεις ένα άβαταρ απο τα προτεινομενα,");
                listBox1.Items.Add("έπειτα να βάλεις το email σου,έναν κωδικό αλλα και στο τέλος το πρωσοπικό σου username. Στην συνέχεια ");
                listBox1.Items.Add("πατησε το κουμπί sign up και να ολοκληρωθει η εγγραφη!! ");
            }
            else if (Form4.f04)
            {
                Form4.f04 = false;
                listBox1.Items.Clear();
                listBox1.Items.Add("Σε αυτην την φόρμα εμφανιζεται η θεωρια για το πρωτο επιπεδο το οποίο αφορα τον UX Designer");
                listBox1.Items.Add("Πάνω αριστερα υπαρχουν 3 κουμπία όπου το κάθε ένα εμφανιζει την θεωρια του ,στο κάτω αριστερα πεδίο");
                listBox1.Items.Add("Αφου διαβασεις την θεωρία και απο τα 3 κουμπία τουλαχιστον 1 φορα ,θα εμφανιστει πάνω δεξια ενα κουμπί");
                listBox1.Items.Add("με το οποίο πατωντας το θα εμφανιστει κατω δεξια το τεστ της ενοτητας ");
                listBox1.Items.Add("Εφοσον το ολοκληρωσεις πατας υποβολη για διορθωση και τα αποτελεσματα θα εμφανιστουν στην οθονη σου!");
                listBox1.Items.Add("Eπισης κανοντας κλικ στο αβαταρ σου πηγαινεις στο προφιλ σου");

            }
            else if (Form6.f06)
            {
                Form6.f06 = false;
                listBox1.Items.Clear();
                listBox1.Items.Add("Σε αυτην την φόρμα εμφανιζεται η θεωρια για το δευτερο επιπεδο το οποίο αφορα τον ΑΙ ΜACHINE LEARNING");
                listBox1.Items.Add("Πάνω αριστερα υπαρχουν 3 κουμπία όπου το κάθε ένα εμφανιζει την θεωρια του ,στο κάτω αριστερα πεδίο");
                listBox1.Items.Add("Αφου διαβασεις την θεωρία και απο τα 3 κουμπία τουλαχιστον 1 φορα ,θα εμφανιστει πάνω δεξια ενα κουμπί");
                listBox1.Items.Add("με το οποίο πατωντας το θα εμφανιστει κατω δεξια το τεστ της ενοτητας ");
                listBox1.Items.Add("Εφοσον το ολοκληρωσεις πατας υποβολη για διορθωση και τα αποτελεσματα θα εμφανιστουν στην οθονη σου!");
                listBox1.Items.Add("Eπισης κανοντας κλικ στο αβαταρ σου πηγαινεις στο προφιλ σου");

            }
            else if (Form7.f07)
            {
                Form7.f07 = false;
                listBox1.Items.Clear();
                listBox1.Items.Add("Σε αυτην την φόρμα εμφανιζεται η θεωρια για το τριτο επιπεδο το οποίο αφορα τον Data Protection");
                listBox1.Items.Add("Πάνω αριστερα υπαρχουν 3 κουμπία όπου το κάθε ένα εμφανιζει την θεωρια του ,στο κάτω αριστερα πεδίο");
                listBox1.Items.Add("Αφου διαβασεις την θεωρία και απο τα 3 κουμπία τουλαχιστον 1 φορα ,θα εμφανιστει πάνω δεξια ενα κουμπί");
                listBox1.Items.Add("με το οποίο πατωντας το θα εμφανιστει κατω δεξια το τεστ της ενοτητας ");
                listBox1.Items.Add("Εφοσον το ολοκληρωσεις πατας υποβολη για διορθωση και τα αποτελεσματα θα εμφανιστουν στην οθονη σου!");
                listBox1.Items.Add("Eπισης κανοντας κλικ στο αβαταρ σου πηγαινεις στο προφιλ σου");

            }
            else if (Form8.f08)
            {
                Form8.f08 = false;
                listBox1.Items.Clear();
                listBox1.Items.Add("Σε αυτην την φόρμα εμφανιζεται η θεωρια για το τεταρτο επιπεδο το οποίο αφορα τον Web Programming");
                listBox1.Items.Add("Πάνω αριστερα υπαρχουν 3 κουμπία όπου το κάθε ένα εμφανιζει την θεωρια του ,στο κάτω αριστερα πεδίο");
                listBox1.Items.Add("Αφου διαβασεις την θεωρία και απο τα 3 κουμπία τουλαχιστον 1 φορα ,θα εμφανιστει πάνω δεξια ενα κουμπί");
                listBox1.Items.Add("με το οποίο πατωντας το θα εμφανιστει κατω δεξια το τεστ της ενοτητας ");
                listBox1.Items.Add("Εφοσον το ολοκληρωσεις πατας υποβολη για διορθωση και τα αποτελεσματα θα εμφανιστουν στην οθονη σου!");
                listBox1.Items.Add("Eπισης κανοντας κλικ στο αβαταρ σου πηγαινεις στο προφιλ σου");

            }

        }
    }
}
